Тест_ЗУП_31_КОРП/src/Catalogs/ТестовыеВопросы/ТестовыеВопросы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТестовыеВопросы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Задание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодРасчетаРезультата</name>
    <type>
      <types>EnumRef.МетодыРасчетаРезультатаТестовогоВопроса</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьВарианты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВопроса</name>
    <type>
      <types>EnumRef.ТипыТестовыхВопросов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФасетныйВопрос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисоединенныйЭлемент</name>
    <type>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
      <types>CatalogRef.ЭлементыЭлектронныхРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенРазвернутыйОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьИменаПолей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеГрупп</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеКатегорий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВариантовОтветов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрафЗаПодсказку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтальноеРазмещениеВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображениеВариантов</name>
    <type>
      <types>EnumRef.ОтображениеВариантовТестовыхВопросов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательныйВыводВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяФорматированныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммныйПродукт</name>
    <type>
      <types>CatalogRef.УчебныеПрограммныеПродукты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрикреплятьКомментарииКВариантамОтвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭтапыРаботыВПрограмме</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ВариантыРаботыСПрограммойЭлектронногоОбучения</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>31</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполняетсяПрограммой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выделить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ЭлектронныеРесурсы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Enums/ТипыТестовыхВопросов/ТипыТестовыхВопросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТестовыхВопросов</name>
  <enumValues>
    <name>МногиеИзМногих</name>
  </enumValues>
  <enumValues>
    <name>ОдинИзМногих</name>
  </enumValues>
  <enumValues>
    <name>Последовательность</name>
  </enumValues>
  <enumValues>
    <name>ПоШаблону</name>
  </enumValues>
  <enumValues>
    <name>Соответствие</name>
  </enumValues>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
  <enumValues>
    <name>ЭлементActiveX</name>
  </enumValues>
  <enumValues>
    <name>Открытый</name>
  </enumValues>
  <enumValues>
    <name>РаботаВПрограмме</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/ВариантыОтветовНаТестовыеВопросы/ВариантыОтветовНаТестовыеВопросы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыОтветовНаТестовыеВопросы</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ТестовыеВопросы</owners>
  <attributes>
    <name>ПрисоединенныйЭлемент</name>
    <type>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
      <types>CatalogRef.ЭлементыЭлектронныхРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВернаяГруппаФасетов</name>
    <type>
      <types>CatalogRef.ФасетыТестовыхВопросов</types>
    </type>
  </attributes>
  <attributes>
    <name>Верный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДоступныхВариантов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииВариантовОтветовТестовыхВопросов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредлагатьВыборВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисоединенныйЭлементВерногоКомментария</name>
    <type>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисоединенныйЭлементОшибочногоКомментария</name>
    <type>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстВарианта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерныйКомментарий</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибочныйКомментарий</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/ТестовыеВопросы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;		
	
	// Заполняем переменные
	
	Тест            = Параметры.Тест;
	Страница        = Параметры.Страница;
	ЭлектронныйКурс = Параметры.ЭлектронныйКурс;

	РазработкаЭлектронныхКурсовСлужебный.УстановитьРодителяНовогоОбъекта(Объект, Параметры, "СправочникСсылка.ТестовыеВопросы");
	
	РазработкаЭлектронныхКурсовСлужебный.УстановитьПредпочитаемогоПоставщика(Объект);
	
	Вес = 1;
	
	Если ЗначениеЗаполнено(Параметры.Страница) Тогда
		Вес = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Страница, "ВесВопроса");
	КонецЕсли;
	
	МассивТиповВопросов = Новый Массив();
	МассивТиповВопросов.Добавить(Перечисления.ТипыТестовыхВопросов.ПоШаблону);
	МассивТиповВопросов.Добавить(Перечисления.ТипыТестовыхВопросов.Таблица);
	МассивТиповВопросов.Добавить(Перечисления.ТипыТестовыхВопросов.Соответствие);
	МассивТиповВопросов.Добавить(Перечисления.ТипыТестовыхВопросов.Открытый);
	МассивТиповВопросов.Добавить(Перечисления.ТипыТестовыхВопросов.ЭлементActiveX);
	МассивТиповВопросов.Добавить(Перечисления.ТипыТестовыхВопросов.РаботаВПрограмме);
	
	МассивПараметровВыбора = Новый Массив();
	
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("ИсключитьЗначения", Новый ФиксированныйМассив(МассивТиповВопросов)));
	Элементы.ТипВопроса.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗагрузитьВерсиюНаСервере(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
			
	ТекущийОбъект.Наименование = ЭлектронноеОбучениеСлужебный.НаименованиеЭлементаИзТекста(Задание);
	ТекущийОбъект.Задание      = Новый ХранилищеЗначения(Задание);

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	
	// Делаем проверки
	
	Если (Объект.ТипВопроса = Перечисления.ТипыТестовыхВопросов.ОдинИзМногих
		ИЛИ Объект.ТипВопроса = Перечисления.ТипыТестовыхВопросов.МногиеИзМногих
		ИЛИ Объект.ТипВопроса = Перечисления.ТипыТестовыхВопросов.Таблица
		ИЛИ Объект.ТипВопроса = Перечисления.ТипыТестовыхВопросов.Последовательность
		ИЛИ Объект.ТипВопроса = Перечисления.ТипыТестовыхВопросов.Соответствие
		ИЛИ Объект.ТипВопроса = Перечисления.ТипыТестовыхВопросов.ПоШаблону)		
		И ВариантыОтветов.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Добавьте варианты ответов'"),,,"ВариантыОтветов",Отказ);				
		Возврат;
		
	КонецЕсли; 
	
	Если Объект.ТипВопроса = Перечисления.ТипыТестовыхВопросов.ОдинИзМногих
		ИЛИ Объект.ТипВопроса = Перечисления.ТипыТестовыхВопросов.МногиеИзМногих Тогда
		
		КоличествоВерныхВариантов = ВариантыОтветов.НайтиСтроки(Новый Структура("Верный", Истина)).Количество();
		
		Если КоличествоВерныхВариантов = 0 Тогда			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите хотя бы один верный вариант ответа'"),,,,Отказ);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	НомерВарианта = 1;
	Для каждого Строка Из ВариантыОтветов Цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.Текст) Тогда			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите текст варианта ответа'"),,ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ВариантыОтветов", НомерВарианта, "Текст"),,Отказ);
			Возврат;
		КонецЕсли;
		
		НомерВарианта = НомерВарианта + 1;
		
	КонецЦикла;		
		
	// Записываем варианты ответа
	
	НомерВарианта = 1;
	
	Для каждого Строка Из ВариантыОтветов Цикл		
		
		Если НЕ ЗначениеЗаполнено(Строка.Ссылка) Тогда
			
			ВариантОбъект = Справочники.ВариантыОтветовНаТестовыеВопросы.СоздатьЭлемент();			
			ВариантОбъект.Владелец = ТекущийОбъект.Ссылка;
			
			РазработкаЭлектронныхКурсовСлужебный.УстановитьПредпочитаемогоПоставщика(ВариантОбъект);
			
			Строка.Ссылка = ВариантОбъект.Ссылка;
			
		Иначе
			
			ВариантОбъект = Строка.Ссылка.ПолучитьОбъект();
			
		КонецЕсли;
		
		ВариантОбъект.Код = НомерВарианта;
		ВариантОбъект.Наименование = Строка.Текст;		
		ВариантОбъект.ТекстВарианта = Новый ХранилищеЗначения(Строка.Текст);
		ВариантОбъект.Верный = Строка.Верный;
		
		ВариантОбъект.Записать();
		
		НомерВарианта = НомерВарианта + 1;
		
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(Страница) Тогда
		Справочники.СтраницыЭлементовЭлектронныхКурсов.Перезаписать(Страница, Вес);	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЭлементКурсаЗаписан", Объект.Ссылка, ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Тест) Тогда
		Оповестить("ПодборкаОбновлена", Тест, ЭтотОбъект);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ТипВопросаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВариантыОтветов

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ВариантыОтветов

&НаКлиенте
Процедура ВариантыОтветовПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда	
		УдалитьВариантОтветаНаСервере(ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтветовВерныйПриИзменении(Элемент)
	
	Если Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыТестовыхВопросов.ОдинИзМногих") Тогда
		
		КоличествоВерныхВариантов = ВариантыОтветов.НайтиСтроки(Новый Структура("Верный", Истина)).Количество();
		
		Если КоличествоВерныхВариантов > 1 Тогда
			Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыТестовыхВопросов.МногиеИзМногих");
		КонецЕсли;
		
	КонецЕсли;		
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УдалитьВариантОтветаНаСервере(ВариантОтвета)
	
	ВариантОтветаОбъект = ВариантОтвета.ПолучитьОбъект();
	ВариантОтветаОбъект.УстановитьПометкуУдаления(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВерсиюНаСервере(ТекущийОбъект)
	
	Если НЕ ТекущийОбъект.Ссылка.Пустая() Тогда 
		
		// Загружаем текст вопроса (задание)
		
		Задание = ТекущийОбъект.Задание.Получить();		
		
		// Загружаем таблицу с данными вариантов ответов
		
		ВариантыОтветов.Очистить();
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВариантыОтветов.Ссылка КАК Ссылка,
		               |	ВариантыОтветов.Верный КАК Верный,
		               |	ВариантыОтветов.ТекстВарианта КАК ТекстВарианта
		               |ИЗ
		               |	Справочник.ВариантыОтветовНаТестовыеВопросы КАК ВариантыОтветов
		               |ГДЕ
		               |	ВариантыОтветов.Владелец = &Владелец
		               |	И ВариантыОтветов.ПометкаУдаления = ЛОЖЬ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ВариантыОтветов.Код";		
		
		Запрос.УстановитьПараметр("Владелец", ТекущийОбъект.Ссылка); 
		
		ВыборкаВариантыОтветов = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаВариантыОтветов.Следующий() Цикл
			
			НоваяСтрока = ВариантыОтветов.Добавить();
			НоваяСтрока.Ссылка = ВыборкаВариантыОтветов.Ссылка;
			НоваяСтрока.Текст = ВыборкаВариантыОтветов.ТекстВарианта.Получить();
			НоваяСтрока.Верный = ВыборкаВариантыОтветов.Верный;
			
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементовФормы(Форма)
	
	// Поле Верный вариантов ответов
	
	Если Форма.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыТестовыхВопросов.Последовательность")
		ИЛИ Форма.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыТестовыхВопросов.Соответствие")
		ИЛИ Форма.Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыТестовыхВопросов.Таблица") Тогда
		
		Форма.Элементы.ВариантыОтветовВерный.Видимость = Ложь;
		
	Иначе
		
		Форма.Элементы.ВариантыОтветовВерный.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
